saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM-C_DFP.1.4.1.pdsc
        <!-- ******************************  ATSAMC20E17A  ****************************** -->
        <device Dname="ATSAMC20E17A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20E17A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20E17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20E18A  ****************************** -->
        <device Dname="ATSAMC20E18A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20E18A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20E18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="26"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20G15A  ****************************** -->
        <device Dname="ATSAMC20G15A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20G15A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20G15A.svd"/>
          <memory     id="IROM1"                        start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                        start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20G16A  ****************************** -->
        <device Dname="ATSAMC20G16A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20G16A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20G16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20G17A  ****************************** -->
        <device Dname="ATSAMC20G17A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20G17A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20G17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20G18A  ****************************** -->
        <device Dname="ATSAMC20G18A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20G18A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20G18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20J15A  ****************************** -->
        <device Dname="ATSAMC20J15A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J15A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J15A.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC20J16A  ****************************** -->
        <device Dname="ATSAMC20J16A">
          <compile header="Device/SAMC20/Include/samc20.h" define="__SAMC20J16A__"/>
          <debug svd="SVD/SAMC20/ATSAMC20J16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

