saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM-C_DFP.1.4.1.pdsc
        <!-- ******************************  ATSAMC21G16A  ****************************** -->
        <device Dname="ATSAMC21G16A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21G16A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21G16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="ADC"           n="2"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21G17A  ****************************** -->
        <device Dname="ATSAMC21G17A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21G17A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21G17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="ADC"           n="2"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21G18A  ****************************** -->
        <device Dname="ATSAMC21G18A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21G18A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21G18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="ADC"           n="2"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J15A  ****************************** -->
        <device Dname="ATSAMC21J15A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J15A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J15A.svd"/>
          <memory     id="IROM1"                        start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                        start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash/ATSAMC_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="ADC"           n="2"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="38"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J16A  ****************************** -->
        <device Dname="ATSAMC21J16A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J16A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J16A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash/ATSAMC_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="ADC"           n="3"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J17A  ****************************** -->
        <device Dname="ATSAMC21J17A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J17A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="ADC"           n="3"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J17AU  ****************************** -->
        <device Dname="ATSAMC21J17AU">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J17AU__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J17AU.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" default="1" startup="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="ADC"           n="3"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J18A  ****************************** -->
        <device Dname="ATSAMC21J18A">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J18A__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="ADC"           n="3"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="52"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21J18AU  ****************************** -->
        <device Dname="ATSAMC21J18AU">
          <compile header="Device/SAMC21/Include/samc21.h" define="__SAMC21J18AU__"/>
          <debug svd="SVD/SAMC21/ATSAMC21J18AU.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" default="1" startup="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="ADC"           n="3"       m="16"          name="Sigma-Delta ADC"/>
          <feature type="AnalogOther"   n="4"                       name="Analog Comparator"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAMC21N17A  ****************************** -->
        <device Dname="ATSAMC21N17A">
          <compile header="Device/SAMC21N/Include/samc21.h" define="__SAMC21N17A__"/>
          <debug svd="SVD/SAMC21N/ATSAMC21N17A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash/ATSAMC_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>

