saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM-C_DFP.1.4.1.pdsc
        <!-- ******************************  ATSAMC21N18A  ****************************** -->
        <device Dname="ATSAMC21N18A">
          <compile header="Device/SAMC21N/Include/samc21.h" define="__SAMC21N18A__"/>
          <debug svd="SVD/SAMC21N/ATSAMC21N18A.svd"/>
          <memory    id="IROM1"                         start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                         start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMC_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash/ATSAMC_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="ADC"           n="12"      m="12"/>
          <feature type="IOs"           n="84"                      name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                     name="TQFP Package"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="SAMC20">
      <description>Microchip SAM C20 devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAMC20[EGJ]*"/>
    </condition>
    <condition id="SAMC20N">
      <description>Microchip SAM C20N devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAMC20N*"/>
    </condition>

    <condition id="SAMC21">
      <description>Microchip SAM C21 devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAMC21[EGJ]*"/>
    </condition>
    <condition id="SAMC21N">
      <description>Microchip SAM C21N devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAMC21N*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SAMC20 CMSIS">
      <description>Microchip SAM C20 devices and CMSIS Core</description>
      <require condition="SAMC20"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="SAMC20N CMSIS">
      <description>Microchip SAM C20N devices and CMSIS Core</description>
      <require condition="SAMC20N"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAMC21 CMSIS">
      <description>Microchip SAM C21 devices and CMSIS Core</description>
      <require condition="SAMC21"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="SAMC21N CMSIS">
      <description>Microchip SAM C21N devices and CMSIS Core</description>
      <require condition="SAMC21N"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup SAMC20 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMC20 CMSIS">
      <description>System Startup for Microchip SAM C20 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/SAMC20/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/SAMC20/Source/ARM/startup_SAMC20.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/SAMC20/Source/system_samc20.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup SAMC20N -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMC20N CMSIS">
      <description>System Startup for Microchip SAM C20N devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/SAMC20N/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/SAMC20N/Source/ARM/startup_SAMC20.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/SAMC20N/Source/system_samc20.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAMC21 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMC21 CMSIS">
      <description>System Startup for Microchip SAM C21 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/SAMC21/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/SAMC21/Source/ARM/startup_SAMC21.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/SAMC21/Source/system_samc21.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup SAMC21N -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMC21N CMSIS">
      <description>System Startup for Microchip SAM C21 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/SAMC21N/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/SAMC21N/Source/ARM/startup_SAMC21.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/SAMC21N/Source/system_samc21.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- SAMC21N-XPRO Board Support -->
    <bundle Cbundle="SAMC21N-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAMC21N-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED"     Capiversion="1.0.0" condition="SAMC21N CMSIS">
      <description>LED driver for Microchip SAMC21N-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAMC21N-XPRO/Common/LED_SAMC21N-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAMC21N CMSIS">
      <description>Button driver for Microchip SAMC21N-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAMC21N-XPRO/Common/Buttons_SAMC21N-XPRO.c"/>
        </files>
      </component>
    </bundle>

  </components>

